{
  "backend/main.mo": "Main actor for the NigeriaPay ICP backend, defining data types (UserProfile, Transaction, MoneyRequest, etc.) and implementing functions for user registration, authentication, money requests, transactions, OTP handling, and Paystack integration with role-based access control.",
  "backend/migration.mo": "Data migration module that upgrades MoneyRequest records from the old schema to the new schema by adding a nullable `requesterEmail` field (defaulting to null).",
  "feature_evidence.json": "Feature evidence report documenting a high-confidence feature requiring updates to `useQueries.ts` and `RequestMoney.tsx` to pass the authenticated user's email from sessionStorage to the `submitMoneyRequest` backend call.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose, key fixes, and notable implementation details for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for the design token system covering light and dark mode colors for backgrounds, foregrounds, cards, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the NigeriaPay React app, setting the page title, favicon, Google Fonts preconnect links, and mounting the React root div with the main module script.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all app routes (public, protected user, and admin) with `isUserAuthenticated()` and `isAdminAuthenticated()` helpers that check multiple sessionStorage keys to guard protected routes.",
  "frontend/src/components/BankAccountLookup.tsx": "Bank account verification component allowing users to select a bank and enter a 10-digit account number to resolve the account holder name via Paystack, with user-friendly error handling for common backend error cases.",
  "frontend/src/components/EmailVerification.tsx": "A multi-step React component that collects email and password, generates a client-side 6-digit OTP, and verifies it before calling an `onVerified` callback. Supports a pre-filled email prop to skip straight to the code-entry step.",
  "frontend/src/components/Layout.tsx": "App shell component providing a sticky header with navigation links, a mobile menu, and logout logic that clears both Internet Identity and sessionStorage auth state. Nav links adapt based on login status and admin role.",
  "frontend/src/components/PhoneVerification.tsx": "Two-step React component for Nigerian phone number verification that calls backend hooks to generate and verify a 6-digit OTP, then invokes an `onVerified` callback with the confirmed phone number.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible dialog that walks new users through a three-step profile setup: phone verification, display name entry, and email/password creation, saving the profile via a backend mutation on completion.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using TanStack Query, attaching the Internet Identity if authenticated and initializing admin access control via a secret token. Invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, persisting delegated identity across page reloads and exposing login/clear functions with status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, authentication (Internet Identity and email), money requests, transactions, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for a Nigeria-themed green/white color scheme with light and dark mode variants.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, NGN currency formatting, date/timestamp formatting, device type detection, and canister-stopped error detection.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying all user profiles, money requests, and transactions in tabs, with controls to fulfill money requests and send money on behalf of users.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that authenticates via the backend and stores an admin session in sessionStorage before redirecting to the admin dashboard.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page showing a welcome message, pending/fulfilled money request counts, and quick-action cards; redirects unauthenticated users to the login page.",
  "frontend/src/pages/Home.tsx": "Landing page for NigeriaPay featuring a hero section, feature cards, supported banks list, and call-to-action buttons linking to signup and login.",
  "frontend/src/pages/Login.tsx": "Login page supporting email/password and phone verification tabs, storing session data in sessionStorage and navigating to the dashboard on success.",
  "frontend/src/pages/Profile.tsx": "User profile page that fetches and displays account details (name, email, phone, login history) with loading skeletons and session-based auth checks.",
  "frontend/src/pages/RequestMoney.tsx": "Authenticated form page for submitting money requests, allowing users to specify bank, account number, amount, and reason, with a fallback list of Nigerian banks.",
  "frontend/src/pages/SendMoney.tsx": "Authenticated page for initiating bank transfers, using a BankAccountLookup component to confirm the recipient and submitting the transfer amount (stored in kobo) via a mutation.",
  "frontend/src/pages/Signup.tsx": "Multi-step signup page (phone verification → user details → email verification → done) that collects user info, validates inputs, registers the user via a backend mutation, and redirects to the dashboard on success.",
  "frontend/src/pages/TransactionHistory.tsx": "Page that displays a user's transaction history fetched from the backend, showing status badges (completed/failed/pending) and handling loading skeletons, errors, and unauthenticated redirects.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, with helpers to persist/retrieve values in sessionStorage and remove sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, extended border radii, box shadows, font families, and animations using the typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Project state document (version 37) describing the Nigeria-only assistance/payment portal's architecture, authentication approach, admin panel requirements, known bugs, and existing features."
}